In [1]:
import numpy as np 
import pandas as pd

In [2]:
from numpy import random
day=list(range(1,11))
day

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [3]:
sales=random.randint(200,400, size=(10))
print(sales)

[281 257 246 315 215 392 233 297 322 389]

In [4]:
visitor=[random.randint(200,350,size=(10))]
print(visitor)

[array([252, 329, 308, 307, 349, 305, 229, 218, 330, 223])]

In [5]:
shop={'Day':[ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10],'Sales':[383, 239 ,249 ,344, 362 ,265 ,390, 322 ,252, 304],'visitor':[202, 273, 255, 247, 306, 322, 224, 259, 240, 216]}
print(shop)

{'Day': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 'Sales': [383, 239, 249, 344, 362, 265, 390, 322, 252, 304], 'visitor': [202, 273, 255, 247, 306, 322, 224, 259, 240, 216]}

In [6]:
data=pd.DataFrame(shop,index=['product a','product b','product c','product d','product e','product f','product g','product h','product i','product j'])

In [7]:
data

           Day  Sales  visitor
product a    1    383      202
product b    2    239      273
product c    3    249      255
product d    4    344      247
product e    5    362      306
product f    6    265      322
product g    7    390      224
product h    8    322      259
product i    9    252      240
product j   10    304      216

In [8]:
data['Day']

product a     1
product b     2
product c     3
product d     4
product e     5
product f     6
product g     7
product h     8
product i     9
product j    10
Name: Day, dtype: int64

In [9]:
data['Sales']

product a    383
product b    239
product c    249
product d    344
product e    362
product f    265
product g    390
product h    322
product i    252
product j    304
Name: Sales, dtype: int64

In [10]:
data['visitor']

product a    202
product b    273
product c    255
product d    247
product e    306
product f    322
product g    224
product h    259
product i    240
product j    216
Name: visitor, dtype: int64

In [11]:
incexp={'income':[2000,2500,3300,1900,2000,4000,5600,2900,5000,3000],'expenses':[3000,6800,5247,6745,1457,2785,4897,3565,35676,9877]}
print(incexp)

{'income': [2000, 2500, 3300, 1900, 2000, 4000, 5600, 2900, 5000, 3000], 'expenses': [3000, 6800, 5247, 6745, 1457, 2785, 4897, 3565, 35676, 9877]}

In [12]:
val=pd.DataFrame(incexp,index=['product a','product b','product c','product d','product e','product f','product g','product h','product i','product j'])

In [13]:
val

           income  expenses
product a    2000      3000
product b    2500      6800
product c    3300      5247
product d    1900      6745
product e    2000      1457
product f    4000      2785
product g    5600      4897
product h    2900      3565
product i    5000     35676
product j    3000      9877

In [14]:
stop=data.join(val)

In [15]:
stop

           Day  Sales  visitor  income  expenses
product a    1    383      202    2000      3000
product b    2    239      273    2500      6800
product c    3    249      255    3300      5247
product d    4    344      247    1900      6745
product e    5    362      306    2000      1457
product f    6    265      322    4000      2785
product g    7    390      224    5600      4897
product h    8    322      259    2900      3565
product i    9    252      240    5000     35676
product j   10    304      216    3000      9877

In [16]:
start={'Day':[11,12],'Sales':[383, 239],'visitor':[202, 273],'income':[2000,2500],'expenses':[3000,6800]}
print(start)

{'Day': [11, 12], 'Sales': [383, 239], 'visitor': [202, 273], 'income': [2000, 2500], 'expenses': [3000, 6800]}

In [17]:
new=pd.DataFrame(start,index=['product k','product l'])

In [18]:
new

           Day  Sales  visitor  income  expenses
product k   11    383      202    2000      3000
product l   12    239      273    2500      6800

In [19]:
value=stop.append(new)

In [20]:
value

           Day  Sales  visitor  income  expenses
product a    1    383      202    2000      3000
product b    2    239      273    2500      6800
product c    3    249      255    3300      5247
product d    4    344      247    1900      6745
product e    5    362      306    2000      1457
product f    6    265      322    4000      2785
product g    7    390      224    5600      4897
product h    8    322      259    2900      3565
product i    9    252      240    5000     35676
product j   10    304      216    3000      9877
product k   11    383      202    2000      3000
product l   12    239      273    2500      6800

In [22]:
value.loc['product d']

Day            4
Sales        344
visitor      247
income      1900
expenses    6745
Name: product d, dtype: int64

In [23]:
min(value['Sales'])

239

In [24]:
max(value['Sales'])

390

In [25]:
value.describe()

             Day       Sales     visitor       income      expenses
count  12.000000   12.000000   12.000000    12.000000     12.000000
mean    6.500000  311.000000  251.583333  3058.333333   7487.416667
std     3.605551   60.511456   38.141980  1225.826870   9183.335435
min     1.000000  239.000000  202.000000  1900.000000   1457.000000
25%     3.750000  251.250000  222.000000  2000.000000   3000.000000
50%     6.500000  313.000000  251.000000  2700.000000   5072.000000
75%     9.250000  367.250000  273.000000  3475.000000   6800.000000
max    12.000000  390.000000  322.000000  5600.000000  35676.000000

In [26]:
value.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12 entries, product a to product l
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Day       12 non-null     int64
 1   Sales     12 non-null     int64
 2   visitor   12 non-null     int64
 3   income    12 non-null     int64
 4   expenses  12 non-null     int64
dtypes: int64(5)
memory usage: 876.0+ bytes

In [27]:
value.shape

(12, 5)

In [28]:
value.isnull()

             Day  Sales  visitor  income  expenses
product a  False  False    False   False     False
product b  False  False    False   False     False
product c  False  False    False   False     False
product d  False  False    False   False     False
product e  False  False    False   False     False
product f  False  False    False   False     False
product g  False  False    False   False     False
product h  False  False    False   False     False
product i  False  False    False   False     False
product j  False  False    False   False     False
product k  False  False    False   False     False
product l  False  False    False   False     False

In [29]:
value.isnull().any()

Day         False
Sales       False
visitor     False
income      False
expenses    False
dtype: bool

In [30]:
value.isnull().any().sum()

0

In [32]:
value.isnull().sum()

Day         0
Sales       0
visitor     0
income      0
expenses    0
dtype: int64

In [36]:
shop=value.to_csv('Sanjana_sweets.csv',index='true')

In [41]:
dat=input('enter the day')
sal=input('enter sales')
vis=input('enter visitor')
inc=input('enter income') 
exp=input('enter expenses')
newval={'Day':[dat],'Sales':[sal],'visitor':[vis],'income':[inc],'expenses':[exp]}
newvalue=pd.DataFrame(newval,index=['product m','product n'])
value1=value.append(newvalue)
value1

enter the day13
enter sales100
enter visitor200
enter income1000
enter expenses1500

          Day Sales visitor income expenses
product a   1   383     202   2000     3000
product b   2   239     273   2500     6800
product c   3   249     255   3300     5247
product d   4   344     247   1900     6745
product e   5   362     306   2000     1457
product f   6   265     322   4000     2785
product g   7   390     224   5600     4897
product h   8   322     259   2900     3565
product i   9   252     240   5000    35676
product j  10   304     216   3000     9877
product k  11   383     202   2000     3000
product l  12   239     273   2500     6800
product m  13   100     200   1000     1500
product n  13   100     200   1000     1500